#@ # 
#@ # Running fm_shell Version L-2016.03-SP1 for linux64 -- Apr 13, 2016
#@ # Date:   Fri Aug 16 03:31:26 2024
#@ # Run by: IC@IC
#@ 

source /opt/Synopsys/Formality2016/admin/setup/.synopsys_fm.setup
#@ # -- Starting source /opt/Synopsys/Formality2016/admin/setup/.synopsys_fm.setup

#@ #
#@ # .synopsys_fm.setup: Initialization File for Formality
#@ #
#@ 
#@ 
#@ #
#@ # Enable stack trace output on fatal.  Not available for all architectures.
#@ #
#@ if { $sh_arch == "sparc" || $sh_arch == "sparcOS5" ||      $sh_arch == "hp700" || $sh_arch == "hpux10" } {
#@   set_unix_variable SYNOPSYS_TRACE ""
#@ }
#@ 
#@ #
#@ # Variable settings
#@ #
#@ set sh_new_variable_message true
#@ 
#@ #
#@ # Synopsys strongly recommends that you uncomment the following command
#@ # in order to set sh_command_abbrev_mode to the value "Command-Line-Only".
#@ # Command abbreviation is intended as an interactive convenience.  Using
#@ # abbreviations in scripts can cause commands to fail in subsequent releases.
#@ # 
#@ #set sh_command_abbrev_mode "Command-Line-Only"
#@ 
#@ #
#@ # Some useful aliases
#@ #
#@ alias list_commands		help
#@ 
#@ #
#@ # The alias of q to quit is commented out.  Remove the comment 
#@ # character if you want this alias.  Some users find that having 
#@ # this particular alias causes problems when mixed with page-mode
#@ # for reports - an accidental repeated 'q' not only cancels the
#@ # output but exits the tool.
#@ #
#@ #alias q quit
#@ # -- End source /opt/Synopsys/Formality2016/admin/setup/.synopsys_fm.setup

set synopsys_auto_setup true 
set_svf -append { /home/IC/Labs/SYSTEM/syn/default.svf } 
read_verilog -container r -libname WORK -05 { /home/IC/Labs/SYSTEM/rtl/ALU.v /home/IC/Labs/SYSTEM/rtl/data_sampling.v /home/IC/Labs/SYSTEM/rtl/DATA_SYNC.v /home/IC/Labs/SYSTEM/rtl/deserializer.v /home/IC/Labs/SYSTEM/rtl/par_chk.v /home/IC/Labs/SYSTEM/rtl/parity_calc.v /home/IC/Labs/SYSTEM/rtl/strt_chk.v /home/IC/Labs/SYSTEM/rtl/UART_TX.v /home/IC/Labs/SYSTEM/rtl/Async_fifo.v /home/IC/Labs/SYSTEM/rtl/BIT_SYNC.v /home/IC/Labs/SYSTEM/rtl/CLKDIV_MUX.v /home/IC/Labs/SYSTEM/rtl/ClkDiv.v /home/IC/Labs/SYSTEM/rtl/CLK_GATE.v /home/IC/Labs/SYSTEM/rtl/edge_bit_counter.v /home/IC/Labs/SYSTEM/rtl/fifo_mem.v /home/IC/Labs/SYSTEM/rtl/fifo_rd.v /home/IC/Labs/SYSTEM/rtl/fifo_wr.v /home/IC/Labs/SYSTEM/rtl/mux.v /home/IC/Labs/SYSTEM/rtl/PULSE_GEN.v } 
read_verilog -container r -libname WORK -05 { /home/IC/Labs/SYSTEM/rtl/RegFile.v /home/IC/Labs/SYSTEM/rtl/RST_SYNC.v /home/IC/Labs/SYSTEM/rtl/Serializer.v /home/IC/Labs/SYSTEM/rtl/stp_chk.v /home/IC/Labs/SYSTEM/rtl/strt_chk.v /home/IC/Labs/SYSTEM/rtl/SYS_CTRL.v /home/IC/Labs/SYSTEM/rtl/SYS_TOP.v /home/IC/Labs/SYSTEM/rtl/uart_rx_fsm.v /home/IC/Labs/SYSTEM/rtl/UART_RX.v /home/IC/Labs/SYSTEM/rtl/uart_tx_fsm.v /home/IC/Labs/SYSTEM/rtl/UART_TX.v /home/IC/Labs/SYSTEM/rtl/UART.v } 
read_db { /home/IC/Labs/SYSTEM/std_cells/scmetro_tsmc_cl013g_rvt_ff_1p32v_m40c.db /home/IC/Labs/SYSTEM/std_cells/scmetro_tsmc_cl013g_rvt_ss_1p08v_125c.db /home/IC/Labs/SYSTEM/std_cells/scmetro_tsmc_cl013g_rvt_tt_1p2v_25c.db } 
set_top r:/WORK/SYS_TOP 
read_verilog -container i -libname WORK -05 { /home/IC/Labs/SYSTEM/syn/System_Top_netlist.v } 
read_db { /home/IC/Labs/SYSTEM/std_cells/scmetro_tsmc_cl013g_rvt_ff_1p32v_m40c.db /home/IC/Labs/SYSTEM/std_cells/scmetro_tsmc_cl013g_rvt_ss_1p08v_125c.db /home/IC/Labs/SYSTEM/std_cells/scmetro_tsmc_cl013g_rvt_tt_1p2v_25c.db } 
set_top i:/WORK/SYS_TOP 
match 
verify 

report_passing_points > "passing_points.rpt"
report_failing_points > "failing_points.rpt"
report_aborted_points > "aborted_points.rpt"
report_unverified_points > "unverified_points.rpt"

